namespace Homework2
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }

        /*
        TODO: Заплановано до виконання до кінця поточного тижня (28.06.2024)

        ДЗ 2. ДЗ 2. Задачі
        1. Реверс строки/масиву.Без додаткового масиву.Складність О(n).
        2. Фільтрування неприпустимих слів у строці.Має бути саме слова, а не частини слів.
        3. Генератор випадкових символів.На вхід кількість символів, на виході рядок з випадковими символами.
        4. "Дірка" (пропущене число) у масиві.Масив довжини N у випадковому порядку заповнений цілими числами з діапазону від 0 до N.Кожне число зустрічається в масиві не більше одного разу. Знайти відсутнє число (дірку). Є дуже простий та оригінальний спосіб вирішення.Складність алгоритму O(N). Використання додаткової пам'яті, пропорційної довжині масиву не допускається.
        5. Найпростіше стиснення ланцюжка ДНК. Ланцюг ДНК у вигляді строки на вхід (кожен нуклеотид представлений символом "A", "C", "G", "T"). Два методи, один для компресії, інший для декомпресії.
        6. Симетричне шифрування.Є строка на вхід, який має бути зашифрований. Ключ можна задати в коді або згенерувати та зберегти.Два методи, шифрування та дешифрування.
        */
    }
}
